#include<iostream>
using namespace std;

float n, m, d;
int a[20][20];
//=============== Функция создания квадратной матрицы ================//
void input() {
    srand((unsigned)(time(NULL))); //Инициализировать генератор случайных цифр
    cout << "Введите количество рядов матрицы: ";
    cin >> n;

    if (n <= 0 || (n - int(n)) != 0) {
        cout << "\n----------------------------\nN - не удовлетворяет условие\n----------------------------\n";
        exit(0);
    }
    cout << "Введите дипазон рандомных цифр массива от 0 до ";
    cin >> d;
    if (d <= 0 || (d - int(d)) != 0) {
        cout << "\n----------------------------\nD - не удовлетворяет условие\n----------------------------\n";
        exit(0);
    }
    int d1 = d + 1;
    cout << "\n";
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            a[i][j] = rand() % d1;
        }
    }
}
//================ Функция вывода квадратной матрицы =================//
void output() {
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cout << a[i][j] << "\t";
        }
        cout << "\n\n\n\n";
    }
    cout << "\n";
}
//================== Функция сумирования элементов ===================//
void sum() {
    int max = 0, imax = 0, jmax = 0, sum = 0;
    //Поиск максимального элемента среди елементов ниже главной диагонали
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i > j && a[i][j] > max) {
                max = a[i][j];
                imax = i;
                jmax = j;
            }
        }
    }
    cout << "Макисмальный элемент ниже главной диагонали = a[" << imax + 1 << "][" << jmax + 1 << "] = " << max << "\n";
    cout << "\n";
    //Сравнение элементов на главной диагонали и выше с максимальным и сумироваение
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i <= j && a[i][j] > max) {
                cout << "Элемент выше главной диагонали > " << max << " = a[" << i + 1 << "][" << j + 1 << "] = " << a[i][j] << "\n";
                sum += a[i][j];
            }
        }
    }
    if (sum != 0) {
        cout << "\n/==================================================================/\n";
        cout << "Сумма = " << sum << "\n";
        cout << "/==================================================================/\n";
    }
    else {
        cout << "Элементов выше главной диагонали > " << max << " - НЕТ\n";
    }
}

int main() {
    setlocale(LC_ALL, "Rus");

    input();

    cout << "Сгенерированная квадратная марица:\n\n";
    output();

    sum();
}