#include<iostream>
using namespace std;

float n, d;
int a[10];
//======================Функция создание массива======================// 
void input() {
    srand((unsigned)(time(NULL))); //инициализировать генератор случайных цифр
    cout << "Введите количество елементов массива N = ";
    cin >> n;
    if (n <= 0 || (n - int(n)) != 0) {
        cout << "\n----------------------------\nN - не удовлетворяет условие\n----------------------------\n";
        exit(0);
    }
    cout << "Введите дипазон рандомных цифр массива от 0 до ";
    cin >> d;
    if (d <= 0 || (d - int(d)) != 0) {
        cout << "\n----------------------------\nD - не удовлетворяет условие\n----------------------------\n";
        exit(0);
    }
    int d1 = d;
    cout << "\n";
    for (int i = 0; i < n; i++) {
        a[i] = rand() % d1;
    }
}
//=======================Функция вывода массива=======================//
void output() {
    for (int i = 0; i < n; i++) {
        cout << a[i] << "\n";
    }
    cout << "\n";
}
//===Функция поиска максимального и минимального элемента массива====//
void find_replace() {
    int min = d, max = 0, imin = 0, imax = 0;
    for (int i = 0; i <= n - 1; i++) {
        //если есть элемент меньше "минимального", присовить значение этого элемента минимальному
        if (a[i] < min) {
            min = a[i];
            imin = i;
        }
        //если есть элемент больше "максимального", присвоить значение этого элемента максимальному
        if (a[i] > max) {
            max = a[i];
            imax = i;
        }
    }
    cout << "MAX = " << max << "\n";
    cout << "MIN = " << min << "\n";
    cout << "\n";
    int tmp = a[imax];
    a[imax] = a[imin];
    a[imin] = tmp;
}

int main() {
    setlocale(LC_ALL, "Rus");

    input();

    cout << "Сгенерированный массив\n";
    output();

    cout << "Максимальный и минимальный элемент массива\n";
    find_replace();

    cout << "Конечный результат\n";
    output();
}